Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/standards_and_accountability/rights_tribunals.html.txt.tmx
Source language: en
Languages: ga

source: There are many tribunals in the State that make binding decisions about people's rights
ga: Tá go leor binsí sa Stát a dhéanann socruithe daingne maidir le cearta daoine

source: A rights tribunal acts like a court; it interprets and applies the law to make binding decisions on disputes between different parties
ga: Feidhmíonn binse cearta ar nós cúirte; míníonn sé an dlí agus cuireann sé é i bhfeidhm chun socruithe daingne a dhéanamh faoi chonspóidí idir pháirtithe difriúla

source: A rights tribunal is established when the Government proposes a Bill that is passed by both Houses of the Oireachtas
ga: Cuirtear binse cearta ar bun nuair a ghlacann an tOireachtas (an Dáil agus an Seanad araon) le bille a chuireann an rialtas faoina bhráid

source: A rights tribunal is usually set up to provide a quick, informal and inexpensive alternative to the courts system in a specific area of law, for example, employment law
ga: De ghnáth bunaítear binse cearta chun rogha éasca, neamhfhoirmeálta agus saor ar chóras na gcúirteanna a thabhairt i réimse ar leith den dlí, mar shampla dlí fostaíochta

source: Rights tribunals deal with a wide range of different types of disputes
ga: Déileálann binsí ceart le réimse leathan aighneas éagsúla

source: The legislation establishing the tribunal sets out how many members will sit on the tribunal and whether they will be lawyers, civil servants or representatives of industry
ga: Socraíonn an reachtaíocht a chuireann an binse ar bun an líon ball a bhéas ann agus cé acu a bheidh mar bhaill, breithimh, dlíodóirí, státseirbhísigh nó ionadaithe ón rannóg tionscail

source: It will also set out the powers of the tribunal and the procedures that will be applied
ga: Socraíonn an reachtaíocht chomh maith cumachtaí an bhinse agus an modh oibre a chuirfear i bhfeidhm

source: The terms of the legislation will state whether or not a decision of the rights tribunal can be appealed in its entirety in the courts
ga: Socróidh téarmaí na reachtaíochta an féidir achomharc iomlán a dhéanamh ar chinneadh an bhinse sna cúirteanna

source: For example, a decision of the Employment Appeals Tribunal can be appealed in the Circuit Court
ga: Mar shampla, is féidir achomharc a dhéanamh ar chinneadh an Bhinse Achomhairc Fostaíochta go dtí an Chúirt Chuarda

source: However, the legislation may also provide that there is no appeal to the court except by way of judicial review in the High Court
ga: D'fhéadfadh an reachtaíocht leagan síos, áfach, nach féidir achomharc a dhéanamh go dtí an Chúirt ach amháin trí athbhreithniú dlíthiúil san Ard-Chúirt

source: This means that the court will not substitute its own verdict for the decision made by the tribunal, but will ensure that the decision was made fairly
ga: Ní chuirfidh an Chúirt a breithiúnas féin in áit cinnidh an bhinse, ach déanfaidh sí cinnte go raibh an cinneadh déanta go cothrom

source: If the decision of the tribunal was made without following fair procedures, it may be set aside by the High Court
ga: Má rinneadh cinneadh an bhinse gan modh oibre cothrom a leanúint, d'fhéadfadh an Chúirt é a chur ar leataobh

source: The State pays the cost of running a rights tribunal
ga: Íocann an Stát as costais bhinse cearta

source: Parties appearing before a rights tribunal generally have to pay for their own legal representation
ga: De ghnáth, bíonn ar pháirtithe atá os comhair binse chearta costais a n-ionadaíocht dlíthiúil féin a íoc

source: Some well-known rights tribunals include:
ga: Seo thíos roinnt binsí ceart cáiliúil:

source: • Criminal Injuries Compensation Tribunal
ga: • An Binse um Chúiteamh ar Dhiobháil Coiriúil

source: This tribunal decides the level of compensation to be paid to persons who have suffered injuries in the course of a criminal act
ga: Socraíonn an binse seo leibhéal an chúitimh a íocfar le daoine a d'fhulaing gortuithe le linn gnímh choiriúil

source: This tribunal investigates disputes between employers and employees and makes recommendations
ga: Déanann an binse seo iniúchadh ar chonspóidí idir fostóirí agus oibrithe agus tugann sé moltaí

source: • International Protection Appeals Tribunal
ga: • An Binse Achomhairc i dtaobh Cosaint Idirnáisiúnta

source: This tribunal hears appeals by asylum seekers against decisions to refuse them international protection
ga: Éisteann an binse seo le hachomhairc ó dhaoine atá ag cuartú tearmainn in aghaidh socruithe gan stádas dídine a thabhairt dóibh

source: This tribunal hears appeals against either the granting or the refusing of planning permission by a planning authority
ga: Éisteann an binse seo le hachomhairc i dtaobh cead phleánala a thug nó a dhiúltaigh údarás pleanála

source: • Social Welfare Appeals Office
ga: • Oifigeach Achomhairc na Roinne Leasa Shóisialaigh

source: The appeals officer decides on applications for allowances or benefits under the social welfare legislation
ga: Déanann an t-oifigeach cinneadh faoi iarratais ar liúntais nó sochair faoin reachtaíocht leasa shóisialaigh

source: At the Office of the Revenue Commissioners, the inspector of taxes is a civil servant who makes an initial assessment of tax
ga: Is státseirbhíseach é/í an cigire cánach in oifig na gCoimisinéirí Ioncaim, a dhéanann measúnú cánach

source: If a taxpayer is dissatisfied with the assessment, he or she can appeal to an Appeals Commissioner
ga: Muna bhfuil cáiníocóir sásta leis an measúnú, d'fhéadfadh sé/sí achomharc a dhéanamh chuig Coimisinéir Achomhairc

source: This tribunal hears disputes in relation to the rateable valuation of properties
ga: Éisteann an binse seo le conspóidí maidir le luach inrátaithe áitreabh

source: The rateable valuation is the value that the local authority puts on property for the purpose of deciding what rates will be charged
ga: Is é an luach inrátaithe ná an luach a chuireann an t-údarás áitiuil ar áitreabh chun cinneadh a dhéanamh faoi na rátaí a ghearrfar air

source: • The Controller of Patents, Designs and Trade Marks decides whether certain inventions are entitled to be registered as patents and whether certain symbols, drawings, marks and shapes may be registered as trade marks
ga: • Déanann an Rialtóir Paitinní, Dearaí agus Trádmharcanna cinneadh an bhfuil aireagáin áirithe i dteideal a bheith cláraithe mar phaitinní agus an féidir siombailí, tarraingtí, agus cruthanna áirithe a chlarú mar thrádmharcanna
